import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:telugu_bible/helper/dimension_helper.dart';
import 'package:telugu_bible/utis/colors.dart';

class HistoryOfMNPScreen extends StatefulWidget {
  const HistoryOfMNPScreen({super.key});

  @override
  State<HistoryOfMNPScreen> createState() => _HistoryOfMNPScreenState();
}

class _HistoryOfMNPScreenState extends State<HistoryOfMNPScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("History of MNP"),
      ),
      body: SafeArea(
        child: SingleChildScrollView(
          scrollDirection: Axis.vertical,
          child: Padding(
            padding: const EdgeInsets.symmetric(horizontal: 10, vertical: 10),
            child: Column(
              // crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text(
                  "మకుటం లేని మహారాజు",
                  textAlign: TextAlign.center,
                  style: GoogleFonts.nunito(
                    fontSize: 20,
                    color: AppColors.kLightGreyColor,
                    fontWeight: FontWeight.bold,
                  ),
                ),
                SizedBox(height: AppDimensionHelper.getHt(7)),
                Text(
                  "డా. నిర్మల ప్రసాద్ మద్దులూరి గారి జీవిత ప్రస్ధానంలో",
                  style: GoogleFonts.nunito(
                    fontSize: 20,
                    color: AppColors.kLightGreyColor,
                    fontWeight: FontWeight.bold,
                  ),
                  textAlign: TextAlign.center,
                ),
                SizedBox(height: AppDimensionHelper.getHt(7)),
                Text(
                  "స రి గ మ లు,  ప ద ని స లు",
                  textAlign: TextAlign.center,
                  style: GoogleFonts.nunito(
                    fontSize: 18,
                    color: Colors.black,
                    fontWeight: FontWeight.bold,
                  ),
                ),
                SizedBox(height: AppDimensionHelper.getHt(20)),
                Text(
                  "జననం : అది క్రీ. శ. 1949 వ. సంవత్సరం ఆగస్ట్ నెల 25 వ. తారీకు. శ్రీయుతులు మద్దులూరి జ్ఞానమణి గారు, శ్రీమతి తోట సౌభాగ్యమ్మ గారు అనే పుణ్యదంపతులకు శ్రీకాకుళ పట్టణం ,ఇలిసిపురం ప్రాంతంలోని జ్ఞానమణి బిల్డింగ్స్ లో స్ఫురద్రూపిగా జ్యేష్ట పుత్రుడు జన్మించిన శుభదినం. ఆయనే డా. నిర్మల ప్రసాద్ మద్దులూరి గారు. \nజ్ఞానమణి గారు నెల్లూరు వాస్తవ్యులు. వారి అన్నదమ్ములు, అక్క కుటుంబములు విద్యాధికులుగా దేశవిదేశాల్లో ఉన్నత పదవులలో  స్ధిరపడిరి. ఆంధ్రప్రదేశ్ లో ఇంజనీరింగ్ కాలేజి లేని రోజుల్లోనే చెన్నైలో B.E. చదివి ఆంధ్రాలో పలు ప్రాంతములలో ఇంజనీర్ గా సేవలనందించారు జ్ఞానమణి గారు. సౌభాగ్యమ్మ గారు గుంటూరు వాస్తవ్యులు, సుసంపన్నులు ,ఉత్తమ ఇల్లాలు, అమాయకురాలు, ఇచ్చుటలో ఉన్న హాయిని తుది శ్వాస వరకు అనుభవించిన వారు, కోడళ్ళను కూతుళ్ళ కంటే ఎక్కువగా చూసిన ఉత్తమ అత్తగారు. వీరి సంతానం : నిర్మల ప్రసాద్, విమల ప్రసాద్, ఆశీష్ కుమార్, సువిశేష్ కుమార్, సుభాకర్, సుధాకర్, సీయోను కుమారి, విజయ కుమారి, జయ కుమారి. \nజ్ఞానమణి దంపతులు రాజమండ్రిలో బైబిల్ మిషన్ వ్యవస్ధాపకులు ముంగమూరి దేవదాసయ్యగారి ప్రియ శిష్యులుగా ఉండేవారు. జ్ఞానమణి గారు దేవదాసయ్య గారి ప్రసంగాలను  ఆంగ్లములోనికి అనువదించి ప్రచురించేవారు. సౌభాగ్యమ్మగారు చాల భక్తిపరులు. చాల దర్శనాలను చూచే వారు, కండ్లు మూసుకొని వాటిని చెప్తూ ఉంటే జ్ఞానమణి గారు వాటిని వ్రాసి కరపత్రికలుగా ముద్రించి పంచేవారు. శ్రీకాకుళం లో దైవజనులకు ఆతిధ్యమిచ్చుటలో తలమునకలై ఉండేవారు. ఇలా భక్తిశ్రద్ధలతో భగవంతుని సేవించేవారు. \nDr.M. N. ప్రసాద్ గారు ఇటు తండ్రి నుండి సునిశిత జ్ఞానమును, తల్లి నుండి సున్నిత హృదయమును , ఆతిధ్యమును; ఇరువురి నుండి భక్తితత్పరతను పుణికిపుచ్చుకొని అత్యున్నత వ్యక్తిత్వాన్ని సంతరించుకున్నారు. బాల్యం : ఆయన బాల్యం ,విద్యాభ్యాసం శ్రీకాకుళం, ఎడవిల్లి, గిద్దలూరు, మార్కాపురం, రాజమండ్రి ప్రాంతాలలో జరిగింది. గురువుల పట్ల ఆయనకున్న గౌరవభావం గణనీయం. ఆయన తండ్రిగారికి తరచుగా జరిగే బదిలీల వలన ఆయన విద్యాభ్యాసం సజావుగా సాగలేదు. అందువలన తండ్రిలా B.E. కాక B.A. మాత్రమే చదివినా సూక్ష్మగ్రాహిగా అపారమైన తెలివితేటలతో బహుముఖ ప్రజ్ఞాశాలిగా వర్ధిల్లారు. \nఉద్యోగపర్వం : సాలూరులో లెప్రసీలో శిక్షణ పొంది తదుపరి అక్కడి హాస్పిటల్ ను ఆయన ఆధ్వర్యములోనే నిర్మించారు. అనంతరం హైదరాబాద్ లో కూడ లెప్రసీ ట్రైనింగ్ పూర్తిచేసి చిన్న చిన్న ఉద్యోగాలు చేసారు. క్రీ. శ. 1972 డిశంబర్ 7న బారువాలో N M A గా గవర్నమెంట్ పోస్టింగ్ వచ్చింది. తదుపరి శ్రీకాకుళం, కొత్తపేట, ఆమదాలవలస, D M& H O ఆఫీస్ లోను డిప్యూటీ పారా మెడికల్ ఆఫీసర్ (గెజిటెడ్ ఆఫీసర్) గా ఉత్తమ సేవలందించి పదవీ విరమణ చేసిరి. పారామెడిక్స్ లో కూడ శిక్షణ పొందిరి. తదనంతరం డా. కేప్స్ మెమోరియల్ సొసైటీలో జాయింట్ సెక్రెటరీగా స్వచ్ఛంద వైద్యసేవలందించారు. అటు ఉద్యోగ బాధ్యతలను సక్రమంగా నిర్వర్తిస్తూనే పలు సామాజిక కార్యక్రమాలను నిర్వహించేవారు. \nవివాహం ~ కుటుంబం : క్రీ. శ. 1972 డిశంబర్ 29న వారి స్వగృహము నందే సౌమ్యురాలు, సౌశీల్యవతి అయిన సామవేదం గిరిజ కుమారితో పరిశుద్ధ పరిణయం జరిగింది. వారికి ముద్దులొలికే ఇద్దరు పిల్లలు. వారిని అల్లారు ముద్దుగా, మంచి క్రమశిక్షణతో ,దైవభక్తితో, మంచి విలువలతో పెంచి విద్యాబుద్ధులతో పాటు సంగీతం కూడ నేర్పించిరి. అడుగులకు మడుగులొత్తే భార్య, ఏమన్నా నోరు మెదపని పిల్లలతో చింతలు లేని చిన్న కుటుంబం వారిది. కుమార్తె నీలిమ శర్మిష్టను పాస్టర్ ప్రేమ్ కుమార్ బాబుకిచ్చి వివాహం జరిపించి “ నీ ప్రధమ సంతతిని దేవుని సేవకు ప్రతిష్టించాలన్న “ దేవుని మాటను నెరవేర్చిరి. వారికిరువురు పిల్లలు జాన్ అభిషేక్, రేచెల్ సంధ్య. వారి కుటుంబమంతా పరమాత్ముని పవిత్ర సేవలో నిమగ్నమై ఉన్నారు.\nడా.యం.ఎన్. ప్రసాద్ గారి ద్వితీయ సంతానం డా.నవీన్ జ్ఞానమణి అగ్రికల్చర్ ఆఫీసర్ (బోర్న్ గెజిటెడ్ ఆఫీసర్) . 4 సార్లు ఉత్తమ ఆఫీసర్ అవార్డు గ్రహీతగా ప్రభుత్వ సేవలోనున్నారు. తనకు లిడియా సుహాసిని B.Sc; B.Ed.(Maths) నిచ్చి నిఖా జరిపించిరి. వీరికిరువురు పిల్లలు. స్వాంతన జ్ఞానమణి (సీనియర్ ఇంటర్), నిశ్చల్ జ్ఞానమణి (టెన్త్ క్లాస్). మేమిద్దరం మాకిద్దరు వారికిద్దరిద్దరు అన్నట్లు వారిది 10 మందిగా సంపూర్ణ కుటుంబం. వీరి వివాహాలలో ఎక్కడా వరకట్నం ప్రసక్తే లేదు. ఆదర్శ కుటుంబం వీరిది. ఈ పదిమందిలో ఎవరికైనా అనారోగ్యం గాని చిన్నసమస్యగాని వస్తే చిగురుటాకులా అల్లాడిపోయేవారు సున్నితమనస్కులైన డా.యం.ఎన్.ప్రసాద్ గారు. భార్యను అణచివేయాలనే ఉద్దేశం లేకపోగా ఇంటర్ Bi.P.C.తో తనవద్దకు వచ్చిన ఆమెను ముందుగా సెకెండరీ గ్రేడ్ టీచర్ ని చేస్తే ఆమె బెస్ట్ టీచర్ గా ఆయన ఖ్యాతిని పెంచారు. ఆనక B.A.స్పెషల్ ఇంగ్లీష్ చదివిస్తే 2nd క్లాస్ లో, B.Ed.చదివిస్తే 1st క్లాస్ లో, M.A.చదివిస్తే మంచి మార్కులతోను పాసై ఆయన కీర్తిని యినుమడింపచేసారు. తరువాత థియాలజీలో మాస్టర్ ఆఫ్ డివినిటీ ; Ph.D లు ఇద్దరూ కలిసి చేసారు. ఆ రీతిగా ఆయన డబుల్ డాక్టర్ అయ్యారు. సతీమణిని డాక్టర్ ని చేసారు. ఇలా భార్య విషయంలో –మట్టిని మాణిక్యముగా మార్చానని మురిసి పోయే వారు. \nవృత్తి ~ ప్రవృత్తులు : డా.యం.ఎన్.ప్రసాద్ గారు వృత్తిపరంగా లెప్రసీ డాక్టరే అయినా MBBS పట్టా లేకున్నా స్వయంకృషితో తనకున్న శ్రద్ధాసక్తులను బట్టి అనేక వైద్య పుస్తకాలు చదివి సుమారు 50 సం.లకు పైనే ఇటు ప్రముఖులకు, అటు కడు బీదలకు, దేశవిదేశాలలోని బంధుమిత్రాదులకు ఉచితముగా ఆఫ్ లైన్, ఆన్ లైన్, ఫోన్ లైన్ వైద్యసేవల నందించి విజవంతముగా తన హస్తవాసిని నిరూపించుకొని ఉత్తమ డాక్టర్ గా వారి హృదయాలలో చెరగని ముద్ర వేసుకున్నారు . ట్రీట్మెంట్ ఇవ్వడమే కాదు తానే వారికి ఫోన్ చేసి యోగక్షేమాలు కనుక్కోవడం ఆయన ప్రత్యేకత.డ్రైవింగ్ ఆయనకు వెన్నతో పెట్టిన విద్య. బాల్యం నుంచి జీవితాంతం వరకు ఇష్టంగా చక్కగా డ్రైవింగ్ చేసేవారు. సతీసమేతంగా శ్రీకాకుళం నుండి హైదరాబాదుకు ఏకబిగిన కార్ డ్రైవ్ చేసుకుంటూ ఒకే రోజులో చేరిపోయేవారు. రిటైరయిన మరు సంవత్సరం సతీమణితో సహా దక్షిణ భారతమును పర్యటించి రిటర్న్ జర్నీలో కుందపోత వర్షంలో చెన్నై కి అవతల  నుంచి 1100 కి.మీ. దూరం ఒకే రోజున ప్రయాణం చేసి దిగ్విజయంగా శ్రీకాకుళం చేరుకున్న సాహసవీరుడాయన. ఇది ఆయన డ్రైవింగ్ నైపుణ్యానికి పరాకాష్ట. నల భీములను తలదన్నిన పాకశాశ్త్ర ప్రవీణులాయన.” The best way to a man’s heart is through his stomach “ అనేది ఆయన నమ్మకం. తన స్వహస్తాలతో రక రకాల non-veg వంటలు చేసి అందరికీ తినిపించి సంతోషించడం ఆయనకెంతో ప్రీతి పాత్రం. హాస్పిటాలిటీకి పెట్టింది పేరాయన. ఆయన ఆతిధ్యాన్ని ఆస్వాదించనివారు తనవైపుగాని, తన అత్తగారి వైపుగాని, బంధువులలో గాని, స్నేహితులలో గాని లేరంటే నమ్మండి. వేట ఆయనకు హాబీ. అడవులలో సంచరిస్తూ కౌజుపిట్టలు, పావురాలు, కొండంగోళ్ళు మొ. వాటిని వేటాడటం సరదా. ఆయన ఎక్సలెంట్ ఫొటోగ్రాఫర్. ” ప్రసాద్ గారు ఫొటో తీసి పంపితే ఖచ్చితంగా ఆ అమ్మాయి పెళ్లైపోతుందని నానుడి “, ఇంతేనా...ఆయనలో ఓ స్విమ్మర్ (చిన్నతనంలో నేలబావిలోకి ఈతకని దూకినప్పుడు కుడిచెవి దెబ్బతిని వినిపించడం మానేసింది.) ; ఓ ఎలక్ట్రీషియన్ ; ఓ టైలర్ ; ఓ ప్రీచర్ ; ఓ టీచర్ ; ఓ ఎడ్మినిస్త్రేటర్ ; ఓ కౌన్సిలర్ (అనేకమందికి ఆయన సలహా శిరోధార్యం) ; ఓ మంచి వక్త ; ఓ గార్డనర్ ; ఓ స్నేహితుడు ; ఓ హాస్యప్రియుడు ; ఓ ప్రకృతి ప్రేమికుడు ; ఎంతటి క్లిష్ట పరిస్ధితినైనా చిటికెలో పరిష్కరించే నేర్పరి ; ఓ ఎఫిషియంట్ మెకానిక్ (కార్ పార్టులన్నీ విప్పేసి మరల బిగించేసేవారంటే చిన్నచిన్నవి ఆయనకు ఒక లెక్కా చెప్పండి) దాగున్నాడంటే అతిశయోక్తి కాదండోయ్. ఇలా ఆయనకు కీర్తి కిరీటాలు ఎన్నెన్నో...ఆయన సాహిత్యాభిలాషి. షేక్స్పియర్ బుక్స్ ; క్రిస్టియన్ నోవెల్స్ (ఇంగ్లీష్) మొ. వి. కొని చదివేవారు. ఆయన త్రిభాషా కోవిదులు. మాతృభాష  తెలుగుపై మంచి పట్టున్నవారు. చక్కని పదప్రయోగం ఆయన సొంతం. జాతీయభాష హిందీ , అంతర్జాతీయ భాష ఇంగ్లీష్ లోను అనర్గళంగా మాట్లాడేవారు. ఆయన జీవన గమనంలో స రి గ మ ల స్ధానం కూడ ప్రస్ఫుటంగా ఉంది. ఆయన ఇంగ్లీష్ క్రిస్టియన్ సాంగ్స్ ఎక్కువగా పాడేవారు, పాత తెలుగు, హిందీ మూవీ సాంగ్స్ కూడ పాడేవారు. ఆర్గాన్ వాయించడంలో ప్రవేశం ఉంది. ఇతరులు పాడుతున్నా, వాయిస్తున్నా అపశృతులను ఇట్టే పట్టేసే సంగీత జ్ఞానం వారి స్వంతం. వారి అమ్మగారి నోట ఎప్పుడూ దేవదాసయ్యగారి పాట ఉండేది. వారి తమ్ముళ్ళు , చెల్లెళ్ళు మంచి గాయకులు. వారి పాప కర్ణాటక సంగీతం ఓకల్ లో, వైలన్ వాయించడం లో నిష్ణాతురాలు, వారి బాబు గిటార్ వాయించడంలో నిపుణుడు. సంస్కారం : ఇరుగువారైనా, పొరుగువారైనా, చిన్నవారైనా, పెద్దవారైనా కనబడితే వెంటనే లేచి నిలబడి కరములు కైమోడ్చి శిరస్సు వంచి నమస్కరించడం ఆయన సంస్కారం. మాటకు ముందు Sir మాటకు వెనుక Sir , Pardon ...ఇదీ ఆయన వైనం.” తన్ను తాను తగ్గించుకొనువాడు హెచ్చింపబడును “ అన్న వాక్య నెరవేర్పుగా ఎంతో తగ్గించుకొని ప్రజల హృదయాల్లో అత్యున్నత స్ధానాన్ని అధిరోహించారాయన. స్వాంతన ట్రస్ట్ : మాతృ మూర్తి నుంచి ఉగ్గుపాలతో దాతృత్వాన్ని అందిపుచ్చుకున్నారు నిర్మల ప్రసాద్ గారు.” Help The Poor & Needy “ అనేది ఆయన నినాదం. {యాకోబు 2 :15, 16} {సహోదరుడైనను సహోదరియైనను దిగంబరులై ఆ నాటికి భోజనము లేక యున్నప్పుడు మీలో ఎవడైనను శరీరమునకు కావలసిన వాటిని ఇయ్యక సమాధానముగా వెళ్ళుడి , చలికాచుకొనుడి , తృప్తి పొందుడని చెప్పిన యెడల ఏమి ప్రయోజనము?}   “నిన్నువలె నీ పొరుగు వానిని ప్రేమించుము “ అన్న రెండవ ఆజ్ఞను మాటతో కాక మనసా వాచా కర్మణా కనుపరచి ; దేవుని సంపూర్ణ హృదయముతోను, పూర్ణాత్మతోను, పూర్ణ వివేకముతోను ప్రేమించి తన ప్రవర్తన ద్వారా క్రీస్తును ప్రజలకు ప్రకటించిన మహనీయుడాయన. బీదల కొరకు ఫ్రీగా మెడికల్ కేంప్స్ నిర్వహించేవారు. లెప్రసీ కోలనీలో, ఎయిడ్స్ పేషెంట్స్ కి , అవసరతలో ఉన్నవారికి ఆహారం పెట్టేవారు. పేదవారికి వస్త్రాల పంపిణీ చేసేవారు. ఆపదలో ఉన్నవారికి ఆపన్న హస్తం అందించి వారికి సాంత్వన చేకూర్చి సంతృప్తిని పొందేవారాయన. ఆయన, ఆయన కుమారుడు కూడ పలుమార్లు రక్తదానం చేసి ఆపదలో నున్నవారి ప్రాణాలు నిలబెట్టారు. అపశృతులు : (ఒక నాణెమునకు బొమ్మ ఉంటే బొరుసు కూడ ఉంటుంది కదా) యుక్తవయస్సులో యింటికి దూరంగా ఒంటరి జీవన యానంలో ఆయనకు కొన్ని దుర్వ్యసనాలు సంక్రమించినా కొన్నాళ్ళకు కుటుంబం పట్ల తనకున్న ప్రేమను బట్టి ; మహోన్నతుని మహాకృపను బట్టి మారిన మనస్సుతో తన తప్పులు దిద్దుకొని వాటిని విసర్జించి దేవుని సేవలో తనదైన శైలిలో వాడబడిన చరితార్ధులు ఆయన. ప్రధమకోపం, ఆదికి ముందు తిట్టడం (యింటివారినే లెండి) , కొన్నిసార్లు ఎదుటివారి మాటలు వినకుండా తనే మాట్లాడడం ఆయన బలహీనతలు. అపాయములు : ఎన్నో ప్రాణగండముల నుండి దేవుడాయనను తప్పించారు. వారి చిన్నప్పుడు వాటర్ టాంక్ లో పడిపోతే కాపాడారు. వారి పిల్లలు చిన్నగా ఉన్నప్పుడు రాజ్ దూత్ ఏక్సిడెంట్ లో కాలు విరిగి 10 నెలలు బెడ్ మీద ఉంటే “ నిన్ను స్వస్ధపరచు యెహోవాను నేనే “ అంటూ స్వస్ధపరిచారు. మరోసారి కాలర్ బోన్ విరిగితే యెహోవా రాఫాగా స్వస్ధపరిచారు. ఒకసారి వారి ఫ్యామిలీ, వారి చెల్లెలి  ఫ్యామిలీతో శ్రీశైలం వెళ్లి తిరిగి వస్తూ ఉండగా బొగద బ్రిడ్జి దగ్గర (చాల ఎత్తైన కొండ ఒకవైపు లోతైన లోయ మరోవైపు) కార్ బ్రేక్స్ ఫెయిల్ అయినప్పుడు 10 మందిని అద్భుతంగా రక్షించాడు మన రక్షకుడు. మరోసారి ఆయన ఒక్కరే వెళ్తున్నప్పుడు ఏక్సిడెంట్ కాగా కార్ డామేజయ్యింది కాని ఆయనకు ఏ దెబ్బ తగలకుండా దేవుడు రక్షించాడు. ఇంకోసారి భార్యతో సహా ప్రయాణిస్తున్నప్పుడు ఏక్సిడెంట్ కాగా కార్ పాడయ్యింది గాని వారిని ఆశ్చర్యకరుడు రక్షించాడు. ఇలా ఎన్నో ఆపదలలో ” నిన్ను విడువను ఎదబాయను “ అన్న దేవుని కృప ఆయనను వెంటాడుతూ వచ్చింది. దేవునికే మహిమ. పర్యాటకం : ఆయన  అవకాశం దొరికినప్పుడల్లా కుటుంబంతో ఆంధ్రాలో పలు ప్రాంతాలను సదర్శించి ప్రకృతి అందాలను తిలకించారు. సతీసమేతముగా కార్ లో దక్షిణ భారతంలో ప్రముఖ ప్రదేశాలను దర్శించారు. భార్యతో, బావమరిది ఫ్యామిలీతో ఉత్తర భారతంలో ప్రఖ్యాతి గాంచిన ప్రాంతాలను వీక్షించారు. ఒంటరిగా తూర్పున ఒడిశా, కోల్ కతా లను; కుమార్తెతో పడమట ముంబయ్ ని సందర్శించారు. భార్యతో, బావమరిది- మరదలు కుటుంబాలతో అండమాన్-నికోబార్ దీవులను సందర్శించారు. ఇలా నలుదిక్కులా పర్యటించి మన భారత దేశపు అందాలను ఆస్వాదించారు.        భక్తిప్రపత్తులు : అపొ. డా. గోడి. సామ్యేలు గారి ప్రియ శిష్యునిగా ,కుడిభుజముగా ఉంటూ ఆయనతోపాటు అనేక ప్రాంతాలలో సువార్త మీటింగ్స్ కి వెళ్తూ , అన్ని విషయాలలో సహకరిస్తూ ఇటు ఉపచారంలోను అటు దైవభక్తిలోను వర్ధిల్లారు. అల్లరితో కూడిన ఆటపాటలు ఆయనకు విరుద్ధం ; ఆధ్యాత్మిక అభివృద్ధికి ఎల్లవేళలా సంసిద్ధం. తన భార్యకు జిల్లాపరిషత్ లో గవర్నమెంటు టీచర్ గా కొయ్యాం లో ఉద్యోగం వచ్చి చేస్తుంటే దేవుని సహవాసానికి దూరమైపోతామని దానిని రిజైన్ చేయించి ప్రమోషన్స్ ఉండని డగ్లస్ మెమోరియల్ ఎయిడెడ్ స్కూల్ లో జాయిన్ చేసారు. ఇది ఆయన దైవభక్తికి మచ్చుతునక. చర్చిలో అన్ని కార్యక్రమాల్లోనూ ప్రముఖపాత్ర పోషించేవారు. వ్యక్తిత్వం : కారుణ్యం ఆయన హృదయ ప్రతిబింబం. చురుకుదనం ఆయన నైజం. {ఆది. 12:1} “ నీవు జనములకు ఆశీర్వాదముగా ఉందువు.” అని దేవుడు అబ్రాహాము కిచ్చిన మాట ప్రసాద్ గారి జీవితంలో అక్షరాలా నెరవేరింది. ఒకరికి పెట్టడంలో ఎముకలేని చేయి , విశాలమైన హృదయం ఆయనది. చిన్న రహస్యమైనా దాచుకోలేనంత చిన్న మనస్సాయనది. ఏ విషయమైనా సూటిగా కుండ బద్దలు కొట్టినట్లు మొహం మీదే మాట్లాడే నిర్మొహమాటి ఆయన. కపటం, కుయుక్తి ఆయనకసహ్యం. ఆయనకు బంధుప్రీతి మెండు. సార్ధకనామధేయునిగా నిర్మల హృదయం, నిష్కాపట్యం, నిజాయితీ, నైతికత, నైపుణ్యం ఆయనకు పెట్టని ఆభారణాలైతే – ఏ విషయానికైనా త్వరితగతిని స్పందించడం, ఏ క్రొత్త విషయాన్ని చూసినా దానిని నేర్చుకోవాలనే తపన, సమయస్ఫూర్తి ఆయనలోని అదనపు ఆకర్షణలు. ఆయన స్ఫురద్రూపం ఆయన అందమైన వ్యక్తిత్వానికి నిలువుటద్దం. ఎందరికో ఆపద్బాంధవుడాయన. అందరి హృదయాల్లో చిరస్మరణీయుడాయన. టోటల్ గా కుటుంబానికి సమాజానికి దేవుని వరప్రసాదం డా. యం.ఎన్.ప్రసాద్ గారు. అంతిమయాత్ర : ఆ భగవంతుడు ఆయనకిచ్చిన ఆయుష్కాలములో ఒక్క రోజు కూడ వ్యర్ధము కాకుండా అర్ధవంతముగా జీవించి తన పరుగు తుదముట్టింఛారు డా.యం.ఎన్. ప్రసాద్ గారు. కీర్తన 139 : 16 లో వ్రాయబడినట్లు {నియమింపబడిన దినములలో ఒకటైన కాకమునుపే నా దినములన్నియు నీ గ్రంథములో లిఖితములాయెను.}... అప్పటికి పదిరోజుల క్రితమే భార్యతో “ నువ్వు లేకుండ నేను ఒక్క రోజైనా బ్రతకలేను “ అన్న ఆయన అకస్మాత్తుగా దేవుని పిలుపునందుకొని హార్ట్ ఎటాక్ తో 26 జూలై 2022 న భార్య చేతిని వదలి కొడుకు గుండెలపై వాలి ఈ పాడులోకం నాకు వద్దు అనుకుని పరమపురికి పయనమై పరమతండ్రి వడిలోనికి ప్రశాంతంగా వెళ్లిపోయారు. దేవునితో నడచిన ఆయన అడుగుజాడలలో నడవడమే ఆయనకు మనమర్పించే ఘనమైన నివాళి. సమస్త మహిమ దేవునికే. పాదాభివందనములతో, అశ్రునయనాలతో ఒంటరిగా మిగిలిన ఆయన సహధర్మచారిణి డా.యం.గిరిజా ప్రసాద్ సామవేదం",
                  textAlign: TextAlign.justify,
                  style: GoogleFonts.lato(
                      fontSize: 16,
                      height: 1.7,
                      color: Colors.black,
                      fontWeight: FontWeight.w400),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
